app/views/users/show.html.erb

  <div class="span8">
    <% if @user.reviews.any? %>
---
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."user_id" = 1