app/controllers/reviews_controller.rb

	 def show
    @review = Review.find(params[:id])
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? ORDER BY microposts.created_at DESC LIMIT 1  [["id", "4"]]

  def index
  @reviews = Review.all
---
SELECT "reviews".* FROM "reviews" ORDER BY microposts.created_at DESC

  def create
    @review = current_user.reviews.build(params[:review])
    if @review.save
---
INSERT INTO "reviews" ("address", "comments", "created_at", "name", "phone", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)

    def destroy
    @review.destroy
---
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 2]]