app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "nickname" = 'RUDOLPH', "password_digest" = '$2a$10$lydfvr0sjcui7ZnaEQNBae5Sl32BP03KjvMOXhkc2OfgVfB/I9Zpu', "remember_token" = 'nznWxnPcPcFQeZzPsjnJsw', "updated_at" = '2012-12-08 20:21:40.926131' WHERE "users"."id" = 1

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "nickname", "password_digest", "remember_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)